link:
https://www.youtube.com/watch?v=WcDaZ67TVRo
data_source:
https://github.com/ifrankandrade/python-course-for-excel-users

# part A: Dimensions

1.core syntax
2.excel with pythons
3.SQL+DB with python(advance)
4.Real case(YT+github) + question banks(buy)

## Part B: modules

1.OS
2.Pandas
  series
  dataframe
  csv
  jason
3.numpy
4.mathlib

## chapter 1: OS modules

In [5]:
"""
To get the location of the current working directory(CWD) os.getcwd() is used.
"""
#import os
import pandas as pd
os.getcwd()

'C:\\Users\\fengs'

In [10]:
os.listdir() 
#show files(elements) under cwd:'C:\\Users\\fengs'

In [13]:
"""
 for creating a new folder:
os.mkdir()
os.makedirs()
"""
# Directory
directory = "GeeksforGeeks"
  
# Parent Directory path
parent_dir = "C:/Users/fengs/Desktop/pd_real"
#copy from pc: C:\Users\fengs\Desktop\pd_real, need to change to /
  
# Path
path = os.path.join(parent_dir, directory)
print(path)
#os.mkdir(path)
print("Directory '% s' created" % directory)

C:/Users/fengs/Desktop/pd_real\GeeksforGeeks
Directory 'GeeksforGeeks' created

In [18]:
#way 1:change \(pc) to /(pw)
os.mkdir('C:/Users/fengs/Desktop/pd_real/gd_2')

#way 2:add r: raw path
os.mkdir(r'C:\Users\fengs\Desktop\pd_real\gd_3')

## chatper 2 Pandas

1.pandas.series() is a one-dimensional labeled array capable of holding data of any type,like a    list
  df is 2-d array
2.pandas.Series( data, index, dtype, name, copy)
3.類似於DF['xxxx'] 單獨一個col

excel            pandas
worksheet        Dataframe
column           series
row heading      index
row              row
Empty cell       NaN

In [2]:
import pandas as pd
import numpy  as np

### 2.1 create DF with list

In [26]:
list = ['g', 'e', 'e', 'k', 's']
ser = pd.Series(list)
ser

0    g
1    e
2    e
3    k
4    s
dtype: object

In [21]:
data=np.array([[1,4],[2,5],[8,9]]) 
print(data)
#[1,4] is 1 row record,[2,5] is 2nd row

[[1 4]
 [2 5]
 [8 9]]

In [25]:
#pandas.Series( data, index, dtype, name, copy)
#pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)
data2=pd.DataFrame(data) 
data2

   0  1
0  1  4
1  2  5
2  8  9

In [27]:
data3=pd.DataFrame(data,index=['row1','row2','row3'],columns=['col1','col2'])
data3  
#index is rows names

      col1  col2
row1     1     4
row2     2     5
row3     8     9

### 2.2 create dataframe with dict

In [1]:
#list for this example
#without numpy 
data=[[1,4],[2,5],[8,9]] #this is n-d list but not array
data

[[1, 4], [2, 5], [8, 9]]

In [4]:
data3=pd.DataFrame(data,index=['row1','row2','row3'],columns=['col1','col2'])
data3  
#so no need to change to numpy first

      col1  col2
row1     1     4
row2     2     5
row3     8     9

### 2.2.2step to create DF from dict

In [7]:
#a 1-d list
state=['California','Texas','Florida','New York']
population=[1000,2000,4000,5000]

In [9]:
"""
store list into a dictionary
need to set keys
d = {
    <key>: <value>,
    <key>: <value>,
    ....
    }
"""
dict={"States":state,"Poplulations":population}
print(dict)

{'States': ['California', 'Texas', 'Florida', 'New York'], 'Poplulations': [1000, 2000, 4000, 5000]}

In [13]:
df_country=pd.DataFrame(dict)
df_country
#'States','Population' become col-headind,
#list

       States  Poplulations
0  California          1000
1       Texas          2000
2     Florida          4000
3    New York          5000

#  chapter 3: create DF from CSV

### 3.1 show DataFrame

In [20]:
#Read csv file =data set 
df_exam=pd.read_csv(r'C:\Users\fengs\Desktop\pd_real\python-course-for-excel-users-main\2.Intro to Pandas\StudentsPerformance.csv')
df_exam.head() #head() show first 5 rows

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [28]:
"""basic attributes,methods
"""
#1.show first 5 rows
df_exam.head(5)

#2.show last 5 rows
df_exam.tail(5)

#3.get access to shape attribute
df_exam.shape #(num of row, num of cols)

#4.display n rows/columns
#pandas.set_option(pat, value)
pd.set_option("display.max_columns", 3)
pd.set_option("display.max_rows", 5)
print(df_exam) #dpn't know why it display incorrectly

     gender  ... writing score
0    female  ...            74
1    female  ...            88
..      ...  ...           ...
998  female  ...            77
999  female  ...            86

[1000 rows x 8 columns]

In [30]:
df_show=pd.set_option("display.max_rows", 5)
print(df_show) #no need to assign to a variable

None

### 3.2 functions +attribute + methods

1.attribute:
   ~a value associate with an object.
   ~ref by name using dotted expression
   ~df.columns
   ~no related any modules/package

2.function
  ~a group of related statements that performs a specific task
  ～通用到whole py script.
  ~eg: python built-in functions: 
  max();min();len()

3.methods
  ~a function which define inside a class body
 ～要import xxxxx
  ~eg：df.head()

In [31]:
import pandas as pd
import numpy  as np

### 3.2.2. attributes

index
columns
axes
dtypes
size
shape
ndim
empty
T
values

In [32]:
#shape attribute
df_exam.shape #(rows,cols)

(1000, 8)

In [33]:
#index attributes
df_exam.index

RangeIndex(start=0, stop=1000, step=1)

In [34]:
#show cols names
df_exam.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [36]:
#DDL(data type) of each columns
df_exam.dtypes

gender            object
race/ethnicity    object
                   ...
reading score      int64
writing score      int64
Length: 8, dtype: object

### 3.2.3 methods

In [5]:
df_exam=pd.read_csv(r'C:\Users\fengs\Desktop\pd_real\python-course-for-excel-users-main\2.Intro to Pandas\StudentsPerformance.csv')

In [38]:
#1.shoew first 4 rows
df_exam.head(4)

#2.show df information
df_exam.info() #better than df_exam.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [39]:
#3. show basic statistic info
df_exam.describe()

       math score  reading score  writing score
count    1000.000       1000.000       1000.000
mean       66.089         69.169         68.054
...           ...            ...            ...
75%        77.000         79.000         79.000
max       100.000        100.000        100.000

[8 rows x 3 columns]

### 3.2.3 functions

In [3]:
#set tools display rows
pd.set_option('display.max_rows', 10)  #
pd.set_option('display.max_columns', 10)  #

In [46]:
#1:numbers of row
len(df_exam) #use df_exam.shape is better

1000

In [48]:
#2. max//min of a columns

df_exam['math score'].max()
#   df_exam.columns #show cols name

100

In [66]:
"""
3. a row of min/max value of a cols
loc(row,col) + condition

"""
df_exam.loc[df_exam['math score'] == df_exam['math score'].max()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100

In [67]:
"""
4. round function:round(x,d) d:decimal point
"""
round(df_exam,2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# chapter 4 Dataframe Query

In [9]:
#1.select df columns
df_exam['gender'].head(4)

0    female
1    female
2    female
3      male
Name: gender, dtype: object

In [10]:
#2.check column type
type(df_exam['gender'])

pandas.core.series.Series

In [16]:
"""
3.select col with dot (has pitfalls陷阱)
"""
#df_exam.gender.head(4) # vs #1
#df_exam.math score  #if name has space,it will error
# vs
df_exam['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

### 4.2 Query Many cols

In [20]:
"""1.use [['x','y','z']],
    pair[]=DataFrame
    single[]=seriese
"""
df_exam.columns
df_exam[['gender', 'race/ethnicity', 'parental level of education']].head(2)

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college

# Chapter 5: DML DataFrame(Numpy)

1.def
NumPy stands for numeric python which is a python package for the computation and processing of the multidimensional and single dimensional array elements.
2.real:
pandas handle n-d list, dictionary
numpy relates to n-d array

In [22]:
df_exam=pd.read_csv(r'C:\Users\fengs\Desktop\pd_real\python-course-for-excel-users-main\2.Intro to Pandas\StudentsPerformance.csv')

In [23]:
df_exam.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [26]:
#1.add col
df_exam['new score']=df_exam['math score']+10
df_exam.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new score
0,female,group B,bachelor's degree,standard,none,72,72,74,82
1,female,group C,some college,standard,completed,69,90,88,79
2,female,group B,master's degree,standard,none,90,95,93,100

In [28]:
"""2.add new cols with numpy
#if DF more than 1000 rows use numpy
"""
import numpy as np

np.arange(0,1000)
len(np.arange(0,1000))

1000

In [32]:
df_exam['new score']=np.arange(0,1000)
df_exam.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2

In [33]:
"""#3.numpy random generate a int [1:100]
   randin(start,end) ,randin=random integer
   random.randint(low, high=None, size=None, dtype=int)
"""
np.random.randint(1,100) #size define 1,gen one int

75

In [35]:
#for each loop, simple
np_ra=np.random.randint(1,100,size=5)
for i in np_ra:
    print(i)

45
32
88
54
10

In [36]:
#standard for loop
np_ra=np.random.randint(1,100,size=5)
for i in range(0,len(np_ra),1):
    print(np_ra[i])

61
90
99
24
17

In [38]:
#4.add col with numpy,random gen num
df_exam['new score']=np.random.randint(1,100,size=1000) #size=1000 as row=1k
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new score
0,female,group B,bachelor's degree,standard,none,72,72,74,34
1,female,group C,some college,standard,completed,69,90,88,69
2,female,group B,master's degree,standard,none,90,95,93,7
3,male,group A,associate's degree,free/reduced,none,47,57,44,37
4,male,group C,some college,standard,none,76,78,75,49

In [39]:
#find min/max row of new score column
df_exam.loc[df_exam['new score'] == df_exam['new score'].max()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new score
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80,99
85,female,group C,some college,standard,none,73,80,82,99
298,male,group C,high school,free/reduced,completed,40,46,50,99
553,male,group D,some college,free/reduced,none,77,62,64,99
612,male,group C,bachelor's degree,standard,completed,94,90,91,99
634,male,group D,some high school,standard,none,84,84,80,99
666,female,group C,some college,free/reduced,completed,63,73,71,99
768,female,group D,some high school,standard,none,68,71,75,99
873,male,group E,associate's degree,free/reduced,none,90,90,82,99
953,male,group C,high school,standard,completed,58,52,54,99

In [40]:
df_exam.loc[df_exam['new score'] == df_exam['new score'].min()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new score
21,female,group B,some college,free/reduced,completed,65,75,70,1
124,male,group E,some college,standard,none,83,80,73,1
156,female,group E,high school,free/reduced,completed,66,74,78,1
236,male,group D,bachelor's degree,free/reduced,none,63,66,67,1
239,male,group C,associate's degree,standard,none,84,80,80,1
...,...,...,...,...,...,...,...,...,...
407,female,group B,associate's degree,standard,none,82,80,77,1
558,female,group B,associate's degree,free/reduced,none,53,70,70,1
580,female,group D,some high school,standard,none,81,97,96,1
899,female,group D,some high school,standard,completed,65,78,82,1
969,female,group B,bachelor's degree,standard,none,75,84,80,1

In [47]:
"""4.create a floating number between 1 and 100+ round up to 2 decimals
numpy.random.uniform(low,high,size)
"""
df_exam['new score']=round(np.random.uniform(1,100,size=1000),2)#if not size=1000, will error
df_exam.head()
#要def function

TypeError: type numpy.ndarray doesn't define __round__ method

# chapter6 operation with Df

In [48]:
import pandas as pd
import numpy  as np
df_exam=pd.read_csv(r'C:\Users\fengs\Desktop\pd_real\python-course-for-excel-users-main\2.Intro to Pandas\StudentsPerformance.csv')

In [49]:
#set tools display rows
pd.set_option('display.max_rows', 10)  #
pd.set_option('display.max_columns', 10)  #
df_exam

In [51]:
"""1.cal sum of a columns
"""
df_exam['math score'].sum()

66089

In [54]:
"""2.count ,mean, std,
"""
df_exam['math score'].count()
df_exam['math score'].mean()
round(df_exam['math score'].std(),2)

15.16

In [55]:
"""3.describle
"""
round(df_exam.describe(),2)

       math score  reading score  writing score
count     1000.00        1000.00        1000.00
mean        66.09          69.17          68.05
std         15.16          14.60          15.20
min          0.00          17.00          10.00
25%         57.00          59.00          57.75
50%         66.00          70.00          69.00
75%         77.00          79.00          79.00
max        100.00         100.00         100.00

In [60]:
"""4.quantile()
numpy.quantile(arr, q, axis = None) 
"""
print(np.quantile(df_exam['reading score'],0.5))
print(np.quantile(df_exam['reading score'],0.75))

70.0
79.0

### 6.2 rows process

In [62]:
#1.total by sum other
df_exam['total']=df_exam['math score']+df_exam['reading score']+df_exam['reading score']
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total
0,female,group B,bachelor's degree,standard,none,72,72,74,216
1,female,group C,some college,standard,completed,69,90,88,249
2,female,group B,master's degree,standard,none,90,95,93,280
3,male,group A,associate's degree,free/reduced,none,47,57,44,161
4,male,group C,some college,standard,none,76,78,75,232